Dlubal.RFEM5.HypothesisType
Type of hypothesis.

Dlubal.RFEM5.HypothesisType.UnknownHypothesisType
Unknown hypothesis type

Dlubal.RFEM5.HypothesisType.VonMisesHypothesis
Von Mises hypothesis

Dlubal.RFEM5.HypothesisType.TrescaHypothesis
Tresca hypothesis

Dlubal.RFEM5.HypothesisType.RankineHypothesis
Rankine hypothesis

Dlubal.RFEM5.HypothesisType.BachHypothesis
Bach hypothesis